
public class slice {
	public static String getLPad(String str, int size) {
        for(int i = (str.getBytes()).length; i < size; i++) {
            str = " " + str;
        }
        return str;
    }
	public static void main(String args[]){
		String[] arr = {
				"01    초코파이                  2,500             1          2,500",
				"02    몽쉘 * 3박스              1,200             3          3,600",
				"03*   하우스 귤1.3kg            3,000             5         15,000",
				"04    포도맛주스5L 200          5,000             7         35,000",
				"05    포도맛 오렌지주스       129,000             3        387,000",
				"06    초코에몽                  3,000             2          6,000",
				"07    우유우 유우유우유         3,600             1          3,600",
				"08    초코우유                  6,000             8         48,000",
				"09    water                     7,000             9         63,000",
				"10    빵                        8,000             7         56,000",
				"11    포카칩 35개들이           3,000         1,500      4,500,000",
				"12*   당근                        520             1            520",
				"13*   사과                        400             3          1,200",
				"14*   france-포도               6,000             2         12,000",
				"15    바나나 맛 아이스          2,033             8         16,264",
				"16    양념치킨 3000인분        19,000             9        171,000",
				"17    휴지                      4,000             7         28,000",
				"18    냄비                      2,000             4          8,000",
				"19    후라이팬                  1,000             5          5,000",
				"20    치약                      3,000             1          3,000",
				"21*   배추김치                  2,000             6         12,000",
				"22*   블루베리                  1,000             4          4,000",
				"23*   여름엔 수박               3,000             7         21,000",
				"24*   빨간색 딸기               5,000             8         40,000",
				"25*   보라색 가지               4,000            10         40,000",
				"26    칫솔                      3,000            20         60,000",
				"27    샴푸                          2             4              8",
				"28    바디워시              1,219,000             7      8,533,000",
				"29    폼클렌징                  7,000             4         28,000",
				"30    로션                     10,000             3         30,000",
		};
		String[] arr1 = {
				"01    초코파이                  2,500             1          2,500",
				"02    몽쉘 * 3박스              1,200             3          3,600",
				"03*   하우스 귤1.3kg            3,000             5        111,000",
				"04    포도맛주스5L 200          5,000             7         35,000",
				"05    포도맛 오렌지주스       129,000             3        387,000",
				"06    초코에몽                  3,000             2          6,000",
				"07    우유우 유우유우유         3,600             1          3,600",
				"08    초코우유                  6,000             8         48,000",
				"09    water                     7,000             9         63,000",
				"10    빵                        8,000             7         56,000",
				"11    포카칩 35개들이           3,000         1,500      4,500,000",
				"12*   당근                        520             1            520",
				"13*   사과                        400             3          1,200",
				"14*   france-포도               6,000             2         12,000",
				"15    바나나 맛 아이스          2,033             8         16,264",
				"16    양념치킨 3000인분        19,000             9        171,000",
				"17    휴지                      4,000             7         28,000",
				"18    냄비                      2,000             4          8,000",
				"19    후라이팬                  1,000             5          5,000",
				"20    치약                      3,000             1          3,000",
				"21*   배추김치                  2,000             6         12,000",
				"22*   블루베리                  1,000             4          4,000",
				"23*   여름엔 수박               3,000             7         21,000",
				"24*   빨간색 딸기               5,000             8         40,000",
				"25*   보라색 가지               4,000            10         40,000",
				"26    칫솔                      3,000            20         60,000",
				"27    샴푸                          2             4            118",
				"28    바디워시              1,219,000             7      8,533,000",
				"29    폼클렌징                  7,000             4         28,000",
				"30    로션                     10,000             3         30,000",
		};
		String[] a = new String[arr1.length];
		String b;
		String c;
		String d;
		int a1,a2;
		
		for(int i=0;i<arr.length;i++){
			try{
				a = arr[i].replaceAll(",","").split("");		
				String nu = a[0] + a[1] + a[2]; // 품번 저장
				String f = a[6] + a[7] + a[8] + a[9] + a[10] + a[11] + a[12] + a[13] + a[14] + a[15] + a[16]; // 상품명 저장
				b = a[22] + a[23] + a[24] + a[25] + a[26] + a[27] + a[28]+ a[29] + a[30] + a[31] + a[32] + a[33] + a[34] + a[35]; // 상품 가격 저장
				a1 = Integer.parseInt(b.trim()); 
				c = a[39] + a[40] + a[41] + a[42] + a[43] + a[44] + a[45] +a[46] + a[47] + a[48] + a[49];
				d = c.trim();
				String[] e = d.split(" ");			
				int x = Integer.parseInt(e[0]);			
				int aa = a1 * x;
				//System.out.println(aa);
				//System.out.printf("%s %s %s %s %s\n",nu,f,a1,c,aa);
				
				
				a2 = arr1[i].getBytes().length - 15;
				String b1 = arr1[i].substring(a2);
				String d1 = b1.replaceAll(",","").trim();
				int aa1 = Integer.parseInt(d1);
				//System.out.println(d1);
				
				
				if ( aa != aa1){
					System.out.println("************************************************");
					System.out.printf("오류[%s %s %s %s %s]\n",nu,f,a1,c,getLPad(String.valueOf(aa1),8));
					System.out.printf("수정[%s %s %s %s %s]\n",nu,f,a1,c,getLPad(String.valueOf(aa),8));
					System.out.println("************************************************");
				}
			}catch(Exception e){
				System.out.println(e.toString());
				System.out.println(e.getMessage());
				e.printStackTrace();
			}
		}
	}
}
